#+startup: overview hideblocks indent inlineimages 
#+options: toc:nil num:nil ^:nil
#+property: header-args:python :session *Python* :results output :exports both :tangle yes 
#+property: header-args:bash :results output :exports both
* Input test

Which Python interpreter are you using?
#+begin_src bash
  which python3
  python3 --version
#+end_src

#+RESULTS:
: /c/Users/birkenkrahe/AppData/Local/Microsoft/WindowsApps/python3
: Python 3.9.13

This program says hello.
#+begin_src python :cmdline < ../data/input :tangle hello.py :session *Python*
  print('hello world')
#+end_src

#+RESULTS:
: hello world

This program draws a plot.
#+begin_src python  :results silent
  import pandas as pd
  from matplotlib import pyplot as plt
  import matplotlib.pyplot as plt

  # pandas load our data
  df = pd.read_csv('../data/ransom.csv')

  # matplotlib plots and displays
  plt.plot(df.letter, df.frequency)
  plt.show()
#+end_src



